export const descriptions = {
  Kilox: {
    title: '千巡科技',
    subTitle: '为爱发电，虽败犹荣',
    date: '2026-02 至 2026-07',
    desc: [
      {
        title: '智能巡检 Agent 平台',
        desc: '负责构建基于 Openclaw 的 A2UI 渲染引擎，实现 Agent 驱动的 UI 动态渲染，流式增量更新，设计并实现 Agent 可调用的 A2UI 生成 skill',
      },
      {
        title: '巡检系统地图编辑器升级',
        desc: '负责将三方编辑器升级为自研的地图编辑器，支持 ddt 格式的渲染及编辑',
      }
    ],
    thinks: [
      '谁让我是3D狂热粉呢？为了摸到3D开发的门槛，果断跳进了这家机器人公司。',
      '在编辑地图的三维空间转啊转，快乐得像在搭积木！',
      '然而……天不遂人愿，公司突然宣布解散，我的3D梦被迫“暂停更新”。',
      '不过没关系，这段经历够我吹一阵子了，江湖路远，咱们下个项目见！🚀'
    ]
  },
  Huawei: {
    title: '华为有限公司',
    subTitle: '卷并友善着',
    date: '2023-04 至 2026-02',
    desc: [
      {
        title: 'CRM PSI 厂商标品搭建',
        desc: '负责从0到1搭建及后续的技术栈迁移，设计基于缓存的请求聚合优化方案，统一前端物料中心搭建',
      }
    ],
    thinks: [
      '因为对SaaS满脑子好奇，一拍脑袋就冲进来了。',
      '同事们确实如传闻中友善，但……卷也是真卷（懂的都懂）。',
      '可惜我负责的PSI系统，复杂逻辑全在后端大佬那儿，前端天天跟复制粘贴式的重复活儿搏斗，让我这颗想搞事情的心，多少有点英雄无用武之地～😅'
    ],
  },
  Shopee: {
    title: '虾皮有限公司',
    subTitle: '白月光本光',
    date: '2019-09 至 2022-10',
    desc: [
      {
        title: '卖家店铺装修可视化平台优化',
        desc: '负责基于可视化编辑器的优化，开发多个物料组件及校验器、撤销/重做、数据备份、模版等核心功能',
      },
      {
        title: '内部论坛优化',
        desc: '负责基于 React、Quill.js 框架开发PC、RN 端的自定义富文本编辑器。实现自定义插件（如投票、视频播放、实时高亮、@提及用户等功能）；优化图片上传与预览体验',
      }
    ],
    thinks: [
      '要说目前为止最爱的公司，非这家莫属！',
      '氛围好到像进了温暖社团，遇到的同事们个个可爱到能组团出道～',
      '工作嘛，继续深耕卖家端前端，后来还“跨界”接了内部论坛等业务线，一边写代码一边吃瓜（不是）。',
      '每天上班都像去赴老友的约，快乐得不像在打工！🥰'
    ],
  },
  amiba: {
    title: '阿米巴有限公司',
    subTitle: '梦开始的地方',
    date: '2017-10 至 2019-07',
    desc: [
      {
        title: '代发系统重构及优化',
        desc: '虚拟滚动和分页缓存，WebSocket实现消息实时提醒，优化 webpck 打包性能，构建速度提高 70%，',
      },
      {
        title: '商家管理系统',
        desc: '负责店铺装修的重构',
      }
    ],
    thinks: [
      '毕业后的第一站，我就这么水灵灵地踏进了前端江湖！',
      '做的是电商业务，专攻卖家端——相当于给掌柜们造“数字兵器”，从商品上架到订单管理，天天和按钮、表格、弹窗斗智斗勇。',
      '虽然现在回头看代码写得像小学生作文，但那可是我“前端魂”熊熊燃烧的起点呀！🔥'
    ],
  },
};

